OpenFOAM-v2112-AD/tutorials/combustion/PDRFoam/pipeLattice/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    outer
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    blockedFaces
    {
        type            zeroGradient;
    }

    mergingFaces
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    wallFaces
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ySymmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
